package utils.StringtoArray;

import com.google.common.collect.Lists;
import com.sun.star.ucb.SearchRecursion;

import java.util.List;
import java.util.StringTokenizer;

/**
 * Created by Peng on 2016/8/17.
 * //如何把一段逗号分割的字符串转换成一个数组
 *  Java将一段逗号分割的字符串转换成一个数组
 */
public class StrToArray{
    //使用String的split 方法
    public static String[] convertStrToArray(String str){
        String[] strArray = null;
        strArray = str.split(","); //拆分字符为"," ,然后把结果交给数组strArray
        return strArray;
    }

    //使用StringTokenizer实现
    //api说明：StringTokenizer 是出于兼容性的原因而被保留的遗留类
    //（虽然在新代码中并不鼓励使用它）。建议所有寻求此功能的人使用
    //String 的 split 方法或 java.util.regex 包
    public static String[] convertStrToArray2(String str){
        StringTokenizer st = new StringTokenizer(str,",");//把","作为分割标志，然后把分割好的字符赋予StringTokenizer对象。
        //通过StringTokenizer 类的countTokens方法计算在生成异常之前可以调用此 tokenizer 的 nextToken 方法的次数。
        String[] strArray = new String[st.countTokens()];
        int i=0;
        while(st.hasMoreTokens()){//看看此 tokenizer 的字符串中是否还有更多的可用标记。
            strArray[i++] = st.nextToken();//返回此 string tokenizer 的下一个标记。
        }
        return strArray;
    }
    //输出数组
    public static void printArray(String[] array){
        for(int i=0;i<array.length;i++){
            System.out.print(array[i]);
            if(i==array.length-1){
                System.out.print("\n");
            }else{
                System.out.print(",");
            }
        }
    }

    /**
     *
     * @param s 一串字符串
     * @param regx 以什么符号进行分割,如_,|/等;注意转义字符
     * @return
     */
    public static List<String> getStr(String s,String regx){
        List<String> array = Lists.newArrayList();
        String[] strings = null;
        strings= s.split(regx);
        for(String s1 :strings){
            array.add(s1);
        }
        return array;
    }

    /**
     *
     * @param string 要切割的字符串
     * @param regx1 第一个分割符
     * @param regx2 第二个分隔符
     * @return
     */
    public static List<List<String>> getStrStr(String string,String regx1,String regx2){

        List<List<String>> result = Lists.newArrayList();
        for (String s:getStr(string,regx1)) {
            List<String> ss = getStr(s, regx2);
            result.add(ss);
        }
        return result;
    }

    public static String getString(){
        return  "亓家|一历城区大桥路111号(黄河大桥收费站北路西亓家庄)|15653103088/15653103066代强_" +
                "工业南一部|一历城区工业南路325号东环仓储货运站|15653103116/0531-82374009刘世冬_" +
                "工业南一部二|历城区工业南路97号东环仓储货运站| 15653102600/1 5653109185曹霞_" +
                "盖家沟|历城区历山北路北口，特星专卖店对面|15653706020/15653109271王学勇_" +
                "零点|历城区零点立交桥南加油站旁20米路西|15653103623/0531-55505969李刚_" +
                "王舍人|历城区王舍人镇开源路1号|15653105663/1 5553-106085李子峰_" +
                "机场路|历城区机场路临港开发区南郭而村|15553106939/15653102600/0531-88062313曹霞_ " +
                "第五库区|陋兹回第五库区七号院7-001|15653106758刘恒建_" +
                "黄台|历城区黄台不锈钢市场13区15号|15653103118/0531-66669868刘帅帅_" +
                "黄台电厂|历城区工业北路黄台电厂东300米路南|15553102182/15154138188任祖波_ " +
                "仲宫|历城区仲北村宏福路西头(老石盘街西邻88米路北)|15550054000/156531092531/0531-82998856韩书宾_" +
                "柳埠|历城区柳埠镇老槐树往东188米(商业街中段)|13287764999/15553705365/0531-82840678韩书宾_" +
                "北外环|天桥区历山北路北日与二环北路交界处向西500札和顺、湘达对过|15653109155/0531-55500470张海潮_ " +
                "洛通|天桥区清河路洛通物流院内|15653103800/0531-85711588王世永_" +
                "滨河一部|天桥区泺口服装城滨河物流园南排1号|15653105883/15615412282李涛_ " +
                "滨河二部|天桥区泺口服装城滨河物流园北排19号|15653103600/15653103398段守琴_ " +
                "泺口|曝回国泺口服装城滨河物流园北排1-9号|15653108871 115653109265/15726402399张小燕_ " +
                "紫金|天桥区小清河南路紫金山儿童城广场|15653103855/15653702878_" +
                "国棉一|天桥区柱子物流园东排4号|156531Ol773/15653109268_" +
                "新三江|天桥区二环北路7088号正门右侧第一家|15653109635/0531-85968951_" +
                "泉胜一部|二环北路泉胜国际物流中心市场D区南首|15653102899/15653102866_" +
                "泉胜二部|天桥区二环北路泉胜国际物流中心市场D区南首|15653109272/15653109252_ " +
                "建华五金|北园大街243号(建华东院) |15553106779/1 5550431635 _" +
                "之江商城|天桥区之江商城东临新黄路35号|15653102878/15653109268_" +
                "中恒一部|天桥区中恒晨安物流5号|15653102966/15653100927/0531-66669863_ " +
                "中恒二部|天桥区济洛路中恒晨安物流南排174-7-61号|15653101056/15653701106l_ " +
                "泉利重配城|天桥区蓝翔路泉利重配城汇通物流园北排5号|15153130869/15553101890_" +
                "大桥|济南黄河大桥桥北400米路东|15553106521/15653102569褚承希_ " +
                "桑梓店|天桥区桑梓店镇角卫国道路北老虎超市|13864186786/15553105791/0531-88070751怀宝海_" +
                "赛博|历下区山大路银座赛博科技市场楼下|15653103158/15653109007邢天生_" +
                "世纪|历下区山大路世纪科技市场楼下|15653103686/15653109170_ " +
                "二期|山大路二期科技市场楼下|15653106100/15653109360 张永昆_ " +
                "利农|历下区山大路百脑汇对面利农小区门口|15553103579/15653106119潘日东_" +
                "华强|历下区山大路华强数码广场楼下|15653103158 邢天生_" +
                "高新区|历下区工业南路69号交运公司院内|15653105962 / 9362/0531-58562774 侯庆峰 _" +
                "牛旺庄|高新区颖秀路与涵源大街交叉口路北|15553103660/15553103609/0531-58687298 何国强 _" +
                "七贤|市中区济微路135号七贤兽药市场南邻|75653103200/78366747775/0531-66669880 _" +
                "英雄山|市中区英雄山路20号保健品批发市场西门门口|1565310821 2/0531-58762007 董国利_" +
                "张庄一部|槐荫区张庄路大运物流市场院内北排732号|15553109687/156531O1076 赵业聪_" +
                "张庄二部|槐荫区张庄路大运物流市场院内北排133号|15653101922/15653709361 王勇_" +
                "段店一部|槐荫区世购后门刘庄停车场南排二号一|15653103557/0531-87106030 曹佃东_" +
                "段店二部|槐荫区世购对面泉丰顺和物流市场院内(客运站西200米路南)|15653102722/15653109262 _" +
                "西市场|槐荫区经一纬九路口同东150米顺祥社区|15653102772/15653109269祁吉室_" +
                "汽配城|槐荫区山东汽配城物流中心88号|15553103365/0531-58687298 范淑英_ " +
                "美里湖|一部：西沙副食批发市场物流园区北排1号|梁兆红15269823888/1 5653102258_ " +
                "美里湖|二部：蓝翔路商贸城物流园区北排6号|梁兆红15269823888/1 5653102258 _" +
                "城市配送|历城区大桥路111号(黄河大桥收费站北路西亓家庄)|15553106802_ " +
                "项目部|历城区大桥路111号(黄河大桥收费站北路西亓家庄)|0531-82778156/827789556j82778056周宾";
    }
    final static String string = "亓家|一历城区大桥路111号(黄河大桥收费站北路西亓家庄)|15653103088/15653103066代强_\n" +
            "工业南一部|一历城区工业南路325号东环仓储货运站|15653103116/0531-82374009刘世冬_\n" +
            "工业南一部二|历城区工业南路97号东环仓储货运站| 15653102600/1 5653109185曹霞_\n" +
            "盖家沟|历城区历山北路北口，特星专卖店对面|15653706020/15653109271王学勇_\n" +
            "零点|历城区零点立交桥南加油站旁20米路西|15653103623/0531-55505969李刚_\n" +
            "王舍人|历城区王舍人镇开源路1号|15653105663/1 5553-106085李子峰_\n" +
            "机场路|历城区机场路临港开发区南郭而村|15553106939/15653102600/0531-88062313曹霞_ \n" +
            "第五库区|陋兹回第五库区七号院7-001|15653106758刘恒建_\n" +
            "黄台|历城区黄台不锈钢市场13区15号|15653103118/0531-66669868刘帅帅_\n" +
            "黄台电厂|历城区工业北路黄台电厂东300米路南|15553102182/15154138188任祖波_ \n" +
            "仲宫|历城区仲北村宏福路西头(老石盘街西邻88米路北)|15550054000/156531092531/0531-82998856韩书宾_\n" +
            "柳埠|历城区柳埠镇老槐树往东188米(商业街中段)|13287764999/15553705365/0531-82840678韩书宾_\n" +
            "北外环|天桥区历山北路北日与二环北路交界处向西500札和顺、湘达对过|15653109155/0531-55500470张海潮_ \n" +
            "洛通|天桥区清河路洛通物流院内|15653103800/0531-85711588王世永_\n" +
            "滨河一部|天桥区泺口服装城滨河物流园南排1号|15653105883/15615412282李涛_ \n" +
            "滨河二部|天桥区泺口服装城滨河物流园北排19号|15653103600/15653103398段守琴_ \n" +
            "泺口|曝回国泺口服装城滨河物流园北排1-9号|15653108871 115653109265/15726402399张小燕_ \n" +
            "紫金|天桥区小清河南路紫金山儿童城广场|15653103855/15653702878_\n" +
            "国棉一|天桥区柱子物流园东排4号|156531Ol773/15653109268_ \n" +
            "新三江|天桥区二环北路7088号正门右侧第一家|15653109635/0531-85968951_\n" +
            "泉胜一部|二环北路泉胜国际物流中心市场D区南首|15653102899/15653102866_\n" +
            "泉胜二部|天桥区二环北路泉胜国际物流中心市场D区南首|15653109272/15653109252_ \n" +
            "建华五金|北园大街243号(建华东院) |15553106779/1 5550431635 _\n" +
            "之江商城|天桥区之江商城东临新黄路35号|15653102878/15653109268_\n" +
            "中恒一部|天桥区中恒晨安物流5号|15653102966/15653100927/0531-66669863_ \n" +
            "中恒二部|天桥区济洛路中恒晨安物流南排174-7-61号|15653101056/15653701106l_ \n" +
            "泉利重配城|天桥区蓝翔路泉利重配城汇通物流园北排5号|15153130869/15553101890_\n" +
            "大桥|济南黄河大桥桥北400米路东|15553106521/15653102569褚承希_ \n" +
            "桑梓店|天桥区桑梓店镇角卫国道路北老虎超市|13864186786/15553105791/0531-88070751怀宝海_\n" +
            "赛博|历下区山大路银座赛博科技市场楼下|15653103158/15653109007邢天生_\n" +
            "世纪|历下区山大路世纪科技市场楼下|15653103686/15653109170_ \n" +
            "二期|山大路二期科技市场楼下|15653106100/15653109360 张永昆_ \n" +
            "利农|历下区山大路百脑汇对面利农小区门口|15553103579/15653106119潘日东_\n" +
            "华强|历下区山大路华强数码广场楼下|15653103158 邢天生_\n" +
            "高新区|历下区工业南路69号交运公司院内|15653105962 / 9362/0531-58562774 侯庆峰_\n" +
            "牛旺庄|高新区颖秀路与涵源大街交叉口路北|15553103660/15553103609/0531-58687298 何国强_\n" +
            "七贤|市中区济微路135号七贤兽药市场南邻|75653103200/78366747775/0531-66669880_\n" +
            "英雄山|市中区英雄山路20号保健品批发市场西门门口|1565310821 2/0531-58762007 董国利_\n" +
            "张庄一部|槐荫区张庄路大运物流市场院内北排732号|15553109687/156531O1076 赵业聪_\n" +
            "张庄二部|槐荫区张庄路大运物流市场院内北排133号|15653101922/15653709361 王勇_\n" +
            "段店一部|槐荫区世购后门刘庄停车场南排二号一|15653103557/0531-87106030 曹佃东_\n" +
            "段店二部|槐荫区世购对面泉丰顺和物流市场院内(客运站西200米路南)|15653102722/15653109262 _\n" +
            "西市场|槐荫区经一纬九路口同东150米顺祥社区|15653102772/15653109269祁吉室_\n" +
            "汽配城|槐荫区山东汽配城物流中心88号|15553103365/0531-58687298 范淑英_ \n" +
            "美里湖|一部：西沙副食批发市场物流园区北排1号|梁兆红15269823888/1 5653102258_ \n" +
            "美里湖|二部：蓝翔路商贸城物流园区北排6号|梁兆红15269823888/1 5653102258 _\n" +
            "城市配送|历城区大桥路111号(黄河大桥收费站北路西亓家庄)|15553106802_ \n" +
            "项目部|历城区大桥路111号(黄河大桥收费站北路西亓家庄)|0531-82778156/827789556j82778056周宾";


    public static void main(String[] args) {

//        System.out.println(getStr(str,"_"));


/////////////////////////////////没有封装之前
/**

        List<String> array = Lists.newArrayList();
        String[] a = null;
        a= str.split("_");
        for(String s :a){
            array.add(s);
        }
//        System.out.println(array);
        List<List<String>> result = Lists.newArrayList();
        for (int i=0;i<array.size();i++) {
            List<String> res = Lists.newArrayList();
            String[] aaa = array.get(i).split("\\|");
            for (String ss : aaa) {
                res.add(ss);
            }
            result.add(res);
        }
        System.out.println(result);
**/
        ///////////////////////封装第一个方法之后
        /**
         List<List<String>> result = Lists.newArrayList();
         for (String s:getStr(str,"_")) {
         List<String> ss = getStr(s, "\\|");
         result.add(ss);
         }
         System.out.println(result);
         **/

        //////////////////////完全封装之后

        System.out.println(getStrStr(StrToArray.string,"_","\\|"));


//        String[] strArray=null;
//        System.out.println("调用convertStrToArray结果：");
//        strArray = convertStrToArray(str);
//        printArray(strArray);
//
//        System.out.println("调用convertStrToArray2结果：");
//        strArray = convertStrToArray2(str);
//        printArray(strArray);
    }
}